After remove `depends_on` from everywhere and running `terraform apply`, I still got the following:
```
bash-4.2# terraform apply
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0642f0fe5497228c2]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ba1b0d8f0f46615b]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=eks-cluster-cluster-20220805182119084400000001]
module.eks.module.eks_managed_node_group["nodes"].aws_iam_role.this[0]: Refreshing state... [id=eks-cluster-assumable-role-managed-20220805182119085800000002]
module.load_balancer_controller_irsa_role.aws_iam_policy.load_balancer_controller[0]: Refreshing state... [id=arn:aws:iam::xxxxxxxxxxxx:policy/AmazonEKS_AWS_Load_Balancer_Controller-20220805183709082800000012]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-08ebcf06b8bdcaeaf]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03816f44872f2db53]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09bf874ee2435050c]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-03db7698ceca10003]
module.eks.module.eks_managed_node_group["nodes"].aws_security_group.this[0]: Refreshing state... [id=sg-0a71e28ee5dcd22e3]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0e1a61ad9234d5677]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-09a716e527119fdaf]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0e489bf93b3222226]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-03744c926df6176fa]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0679f361e9df13d7a]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-04f1894a68756a181]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-092c0fe460c17a0eb]
module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=eks-cluster-cluster-20220805182119084400000001-20220805182119923000000006]
module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=eks-cluster-cluster-20220805182119084400000001-20220805182119914700000005]
module.eks.module.eks_managed_node_group["nodes"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=eks-cluster-assumable-role-managed-20220805182119085800000002-20220805182119865300000004]
module.eks.module.eks_managed_node_group["nodes"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=eks-cluster-assumable-role-managed-20220805182119085800000002-20220805182119950700000007]
module.eks.module.eks_managed_node_group["nodes"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=eks-cluster-assumable-role-managed-20220805182119085800000002-20220805182119862100000003]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-074f6699bf604fcc0]
module.eks.aws_security_group_rule.node["egress_ntp_tcp"]: Refreshing state... [id=sgrule-211771888]
module.eks.aws_security_group_rule.node["egress_self_coredns_udp"]: Refreshing state... [id=sgrule-1900063582]
module.eks.aws_security_group_rule.node["egress_cluster_443"]: Refreshing state... [id=sgrule-4179765620]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-805878554]
module.eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-3544276206]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2590742756]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2488735989]
module.eks.aws_security_group_rule.cluster["egress_nodes_443"]: Refreshing state... [id=sgrule-3952766455]
module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"]: Refreshing state... [id=sgrule-4280756536]
module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"]: Refreshing state... [id=sgrule-2317440418]
module.eks.aws_security_group_rule.node["egress_ntp_udp"]: Refreshing state... [id=sgrule-1912685821]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3563831619]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1002953087]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-00d16746b7ee8c418]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-092ff8f2d081b82d9]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d6fbbfcd656c39eb]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-092c0fe460c17a0eb1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09a716e527119fdaf1080289494]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0053ce92dcbedfe89]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0aafa99103597a737]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c3d744046ba24606]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=eks-cluster]
module.eks.module.eks_managed_node_group["nodes"].aws_eks_node_group.this[0]: Refreshing state... [id=eks-cluster:nodes-20220805204452224300000001]
module.cluster_autoscaler_irsa_role.aws_iam_policy.cluster_autoscaler[0]: Refreshing state... [id=arn:aws:iam::xxxxxxxxxxxx:policy/AmazonEKS_Cluster_Autoscaler_Policy-2022080518340592660000000d]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::xxxxxxxxxxxx:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/xxxxxxxxxxxx]
helm_release.metrics_server: Refreshing state... [id=metrics-server-release]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=eks-cluster:kube-proxy]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=eks-cluster:coredns]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=eks-cluster:vpc-cni]
module.cluster_autoscaler_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=cluster-autoscaler]
module.load_balancer_controller_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=load-balancer-controller]
module.cluster_autoscaler_irsa_role.aws_iam_role_policy_attachment.cluster_autoscaler[0]: Refreshing state... [id=cluster-autoscaler-2022080518340745950000000e]
module.load_balancer_controller_irsa_role.aws_iam_role_policy_attachment.load_balancer_controller[0]: Refreshing state... [id=load-balancer-controller-20220805183710018200000013]
helm_release.load_balancer_controller: Refreshing state... [id=load-balancer-controller-release]
helm_release.cluster_autoscaler: Refreshing state... [id=cluster-autoscaler-release]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # module.eks.module.eks_managed_node_group["nodes"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "eks-cluster:nodes-20220805204452224300000001"
      + labels                 = {}
        tags                   = {
            "Name" = "nodes"
        }
        # (15 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the
following plan may include actions to undo or respond to these changes.

──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.eks.module.eks_managed_node_group["nodes"].aws_eks_node_group.this[0] must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ arn                    = "arn:aws:eks:us-east-1:xxxxxxxxxxxx:nodegroup/eks-cluster/nodes-20220805204452224300000001/80c137e0-7c24-b06b-8fa1-b2c07978f00f" -> (known after apply)
      ~ id                     = "eks-cluster:nodes-20220805204452224300000001" -> (known after apply)
      ~ instance_types         = [ # forces replacement
            "t2.small",
          + "t2.small",
        ]
      - labels                 = {} -> null
      ~ node_group_name        = "nodes-20220805204452224300000001" -> (known after apply)
      ~ release_version        = "1.22.9-20220725" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-nodes-20220805204452224300000001-80c137e0-7c24-b06b-8fa1-b2c07978f00f"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "Name" = "nodes"
        }
        # (9 unchanged attributes hidden)



      ~ update_config {
          ~ max_unavailable            = 1 -> (known after apply)
          ~ max_unavailable_percentage = 0 -> (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value:
  ```